In [1]:
import json
import mysql.connector
import pandas as pd

from IPython.display import display, Markdown, HTML

db = mysql.connector.connect(
    host="localhost",
    user="root",
    password="secret",
    port="3306",
    database="serlo",
    charset="latin1"
)

def query(sql):
    c = db.cursor()
    c.execute(sql)
    
    return c.fetchall()

def querySingleton(sql):
    return [ x[0] for x in query(sql) ]

/home/kulla/.local/share/asdf/installs/python/3.9.1/lib/python3.9/site-packages/pandas/compat/__init__.py:97: UserWarning: Could not import the lzma module. Your installed Python is incomplete. Attempting to use lzma compression will result in a RuntimeError.
  warnings.warn(msg)

In [22]:
pd.read_sql("""
            SELECT DISTINCT(r.id)
            FROM entity_revision r
            INNER JOIN uuid u_r ON r.id = u_r.id
            INNER JOIN entity e ON e.id = r.repository_id
            INNER JOIN uuid u_e ON e.id = u_e.id
            LEFT JOIN entity_link el1 ON el1.child_id = u_e.id
            LEFT JOIN entity_link el2 ON el2.child_id = el1.parent_id
            JOIN term_taxonomy_entity tte ON tte.entity_id IN (e.id, el1.parent_id, el2.parent_id)
            JOIN term_taxonomy t0 ON t0.id = tte.term_taxonomy_id
            LEFT JOIN term_taxonomy t1 ON t1.id = t0.parent_id
            LEFT JOIN term_taxonomy t2 ON t2.id = t1.parent_id
            LEFT JOIN term_taxonomy t3 ON t3.id = t2.parent_id
            LEFT JOIN term_taxonomy t4 ON t4.id = t3.parent_id
            LEFT JOIN term_taxonomy t5 ON t5.id = t4.parent_id
            LEFT JOIN term_taxonomy t6 ON t6.id = t5.parent_id
            LEFT JOIN term_taxonomy t7 ON t7.id = t6.parent_id
            LEFT JOIN term_taxonomy t8 ON t8.id = t7.parent_id
            LEFT JOIN term_taxonomy t9 ON t9.id = t8.parent_id
            LEFT JOIN term_taxonomy t10 ON t10.id = t9.parent_id
            LEFT JOIN term_taxonomy t11 ON t11.id = t10.parent_id
            LEFT JOIN term_taxonomy t12 ON t12.id = t11.parent_id
            LEFT JOIN term_taxonomy t13 ON t13.id = t12.parent_id
            LEFT JOIN term_taxonomy t14 ON t14.id = t13.parent_id
            LEFT JOIN term_taxonomy t15 ON t15.id = t14.parent_id
            LEFT JOIN term_taxonomy t16 ON t16.id = t15.parent_id
            LEFT JOIN term_taxonomy t17 ON t17.id = t16.parent_id
            LEFT JOIN term_taxonomy t18 ON t18.id = t17.parent_id
            LEFT JOIN term_taxonomy t19 ON t19.id = t18.parent_id
            LEFT JOIN term_taxonomy t20 ON t20.id = t19.parent_id
            WHERE ( e.current_revision_id IS NULL OR r.id > e.current_revision_id )
                AND u_r.trashed = 0
                AND u_e.trashed = 0
                AND (el1.type_id is NULL OR el1.type_id = 9)
                AND (el2.type_id is NULL OR el2.type_id = 9)
                AND 5 IN (t0.id, t1.id, t2.id, t3.id, t4.id, t5.id, t6.id,
                          t7.id, t8.id, t9.id, t10.id, t11.id, t12.id, t13.id,
                          t14.id, t15.id, t16.id, t17.id, t18.id, t19.id, t20.id)
            ORDER BY r.id
""", db)

        id
0   209756
1   220572
2   220770
3   220771
4   220944
5   221006
6   221181
7   221269
8   221276
9   221277
10  221278
11  221456
12  221458
13  221485
14  221486
15  221487
16  221488
17  221533
18  221606
19  221607
20  221608
21  221609
22  221610
23  221611
24  221612
25  221613
26  221614
27  221615
28  221616